balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F86J90.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA16" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA16" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA16" edc:desc="" edc:mask="0xff" edc:name="LCDDATA16" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S32C2" edc:desc="" edc:mask="0x1" edc:name="S32C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S33C2" edc:desc="" edc:mask="0x1" edc:name="S33C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S34C2" edc:desc="" edc:mask="0x1" edc:name="S34C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S35C2" edc:desc="" edc:mask="0x1" edc:name="S35C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S36C2" edc:desc="" edc:mask="0x1" edc:name="S36C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S37C2" edc:desc="" edc:mask="0x1" edc:name="S37C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S38C2" edc:desc="" edc:mask="0x1" edc:name="S38C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S39C2" edc:desc="" edc:mask="0x1" edc:name="S39C2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG32COM2" edc:desc="" edc:mask="0x1" edc:name="SEG32COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG33COM2" edc:desc="" edc:mask="0x1" edc:name="SEG33COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG34COM2" edc:desc="" edc:mask="0x1" edc:name="SEG34COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG35COM2" edc:desc="" edc:mask="0x1" edc:name="SEG35COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG36COM2" edc:desc="" edc:mask="0x1" edc:name="SEG36COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG37COM2" edc:desc="" edc:mask="0x1" edc:name="SEG37COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG38COM2" edc:desc="" edc:mask="0x1" edc:name="SEG38COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG39COM2" edc:desc="" edc:mask="0x1" edc:name="SEG39COM2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA17" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA17" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA17" edc:desc="" edc:mask="0xff" edc:name="LCDDATA17" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S40C2" edc:desc="" edc:mask="0x1" edc:name="S40C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S41C2" edc:desc="" edc:mask="0x1" edc:name="S41C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S42C2" edc:desc="" edc:mask="0x1" edc:name="S42C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S43C2" edc:desc="" edc:mask="0x1" edc:name="S43C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S44C2" edc:desc="" edc:mask="0x1" edc:name="S44C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S45C2" edc:desc="" edc:mask="0x1" edc:name="S45C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S46C2" edc:desc="" edc:mask="0x1" edc:name="S46C2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S47C2" edc:desc="" edc:mask="0x1" edc:name="S47C2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG40COM2" edc:desc="" edc:mask="0x1" edc:name="SEG40COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG41COM2" edc:desc="" edc:mask="0x1" edc:name="SEG41COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG42COM2" edc:desc="" edc:mask="0x1" edc:name="SEG42COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG43COM2" edc:desc="" edc:mask="0x1" edc:name="SEG43COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG44COM2" edc:desc="" edc:mask="0x1" edc:name="SEG44COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG45COM2" edc:desc="" edc:mask="0x1" edc:name="SEG45COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG46COM2" edc:desc="" edc:mask="0x1" edc:name="SEG46COM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG47COM2" edc:desc="" edc:mask="0x1" edc:name="SEG47COM2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA18" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA18" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA18" edc:desc="" edc:mask="0xff" edc:name="LCDDATA18" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S00C3" edc:desc="" edc:mask="0x1" edc:name="S00C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S01C3" edc:desc="" edc:mask="0x1" edc:name="S01C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S02C3" edc:desc="" edc:mask="0x1" edc:name="S02C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S03C3" edc:desc="" edc:mask="0x1" edc:name="S03C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S04C3" edc:desc="" edc:mask="0x1" edc:name="S04C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S05C3" edc:desc="" edc:mask="0x1" edc:name="S05C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S06C3" edc:desc="" edc:mask="0x1" edc:name="S06C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S07C3" edc:desc="" edc:mask="0x1" edc:name="S07C3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG00COM3" edc:desc="" edc:mask="0x1" edc:name="SEG00COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG01COM3" edc:desc="" edc:mask="0x1" edc:name="SEG01COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG02COM3" edc:desc="" edc:mask="0x1" edc:name="SEG02COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG03COM3" edc:desc="" edc:mask="0x1" edc:name="SEG03COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG04COM3" edc:desc="" edc:mask="0x1" edc:name="SEG04COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG05COM3" edc:desc="" edc:mask="0x1" edc:name="SEG05COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG06COM3" edc:desc="" edc:mask="0x1" edc:name="SEG06COM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG07COM3" edc:desc="" edc:mask="0x1" edc:name="SEG07COM3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S0C3" edc:desc="" edc:mask="0x1" edc:name="S0C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S1C3" edc:desc="" edc:mask="0x1" edc:name="S1C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S2C3" edc:desc="" edc:mask="0x1" edc:name="S2C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S3C3" edc:desc="" edc:mask="0x1" edc:name="S3C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S4C3" edc:desc="" edc:mask="0x1" edc:name="S4C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S5C3" edc:desc="" edc:mask="0x1" edc:name="S5C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S6C3" edc:desc="" edc:mask="0x1" edc:name="S6C3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S7C3" edc:desc="" edc:mask="0x1" edc:name="S7C3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
